
<h1>简介</h1>

<h3>欢迎使用 Codekart</h3>

<p>Codekart 是一套给 Node.js 开发者使用的应用程序开发框架和工具包。
  它提供一套丰富的标准库以及简单的接口和逻辑结构，
  其目的是使开发人员更快速地进行项目开发。
  使用 Codekart 可以减少代码的编写量，
  并将你的精力投入到项目的创造性开发上。</p>

<h3>Codekart 特点</h3>

<p>Codekart 是一个轻量级但功能强大的 Node.js 框架，
让你在高性能 javascript 引擎 V8 下， 如同 PHP 一样简单而且快速地建立 web 站点。</p>

<pre>
• 它是轻量级，同时也是功能强大的。因为你只需要加载最基本的模块，
  并在你使用其他功能时按需加载，不用一次性载入臃肿而庞大的库。

• 它是零配置的。你只需要把文件拷贝至服务器目录，然后执行 node index.js ，
  框架就成功启动了。

• 它是精简的。Codekart 信奉 JQuery 的设计哲学： write less do more 。

• 它是前后端一体化的。你可以像写配置文件一样编写web页面，
  我们自动帮你完成 js、css 文件的模块化加载和压缩合并，
  并自动在html里引用。自动完成html模板的解析。一切都是那么简单而富有条理。

• 集成了常用的前端控件，例如翻页和滚动插件，tip 提示框等等
</pre>

